app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
	def index
		index!{
			@search = Concert.search(params[:q])