app/controllers/locals_controller.rb

  def show
    @local = Local.find(params[:id])
---
SELECT "locals".* FROM "locals" WHERE "locals"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @local = Local.new(params[:local])

    respond_to do |format|
      if @local.save
---
INSERT INTO "locals" ("address", "created_at", "district", "gmaps", "latitude", "longitude", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)