app/controllers/music_styles_controller.rb

  def index
    @music_styles = MusicStyle.all
---
SELECT "music_styles".* FROM "music_styles"

  def show
    @music_style = MusicStyle.find(params[:id])
---
SELECT "music_styles".* FROM "music_styles" WHERE "music_styles"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @music_style = MusicStyle.new(params[:music_style])

    respond_to do |format|
      if @music_style.save
---
INSERT INTO "music_styles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 08 Jun 2013 22:50:58 UTC +00:00], ["name", "Jazz"], ["updated_at", Sat, 08 Jun 2013 22:50:58 UTC +00:00]]