app/views/musical_groups/_form.html.erb

SELECT "music_styles".* FROM "music_styles"
---
      <%= f.label :music_style %><br />
      <%= f.collection_select :music_style_id, MusicStyle.all, :id, :name, :prompt => true %>

SELECT "users".* FROM "users"
---
        </tr>
        <% @musical_group.users.each do |user| %>